###############################################################################
# Created by write_sdc
# Sat May  9 10:52:49 2026
###############################################################################
current_design uart_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {cts_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dcd_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dsr_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rd_en}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ri_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx_in}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wdata[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wr_en}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {break_int}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dr}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dtr}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {framing_err}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {irq}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out1}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out2}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {parity_err}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdata[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rts}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {temt}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {thre}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx_out}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {break_int}]
set_load -pin_load 0.0334 [get_ports {dr}]
set_load -pin_load 0.0334 [get_ports {dtr}]
set_load -pin_load 0.0334 [get_ports {framing_err}]
set_load -pin_load 0.0334 [get_ports {irq}]
set_load -pin_load 0.0334 [get_ports {out1}]
set_load -pin_load 0.0334 [get_ports {out2}]
set_load -pin_load 0.0334 [get_ports {parity_err}]
set_load -pin_load 0.0334 [get_ports {rts}]
set_load -pin_load 0.0334 [get_ports {temt}]
set_load -pin_load 0.0334 [get_ports {thre}]
set_load -pin_load 0.0334 [get_ports {tx_out}]
set_load -pin_load 0.0334 [get_ports {rdata[7]}]
set_load -pin_load 0.0334 [get_ports {rdata[6]}]
set_load -pin_load 0.0334 [get_ports {rdata[5]}]
set_load -pin_load 0.0334 [get_ports {rdata[4]}]
set_load -pin_load 0.0334 [get_ports {rdata[3]}]
set_load -pin_load 0.0334 [get_ports {rdata[2]}]
set_load -pin_load 0.0334 [get_ports {rdata[1]}]
set_load -pin_load 0.0334 [get_ports {rdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cts_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dcd_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dsr_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rd_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ri_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wr_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wdata[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
